//Tropical Cyclone Warning
const tcWarnings = [
  {
    icon:"",
    text: "晚上10時，位於南海東北部的熱帶低氣壓集結在本澳東南偏東約610公里，即在北緯20.9度，東經119.3度附近，其中心附近最高持續風速約為每小時45公里，向東北移動，時速25公里，移向台灣南部一帶。(2026-06-04 23:00 MST)"
  },
];

//Warning
const warnWarnings = [
  {
    icon: "warn_icon/h2.jpg",
    text: "非常酷熱警報於本地時間06月04日12時30分發出。預料本澳今明兩日天氣非常酷熱。"
  },
  {
    icon: "",
    text: ""
  },
  {
    icon:"",
    text: ""
  }
];

//Special Warning Tips
const swtText = `位於南海東北部的低壓區已經發展為熱帶低氣壓，但預計對澳門構成直接影響機會不大。除非該熱帶低氣壓採取較預期更接近澳門路徑移動，否則無需發出熱帶氣旋警報。

按照現時預測路徑，熱帶低氣壓今日最接近本澳，受到其相關外圍下沉氣流影響，將會加劇明日的酷熱天氣，天氣非常酷熱，部份地區將達36-37度。本台將會密切監察其發展及動向。

(2026-06-04 17:40 MST)
`;

//Alert Tips
const alertipsText = `高溫預警提示於本地時間05月23日19時20分發出。表示澳門高溫天氣持續。（2026-06-04 14:20 MST 更新)
`;

//Weather Forecast
const forecastRaw = `受到一道副熱帶高壓脊影響，預計本澳未來數日天氣晴朗。同時，現時位於南海的一個低壓區將會橫過南海東北部並靠近台灣一帶。受到其相關外圍下沉氣流影響，預計明日天氣非常酷熱，部份地區可能超過36-37度。同時，低層偏南氣流亦持續影響本澳，為大氣提供足夠水氣條件。配合高溫，本澳明日下午至黃昏有可能觸發熱對流發展，部份地區可能會出現驟雨及雷暴。一個偏東氣流將會在週末期間逐漸影響本澳，與西南季候風匯聚形成輻合帶，珠江口一帶下週初至中期雨勢加強，有大雨及雷暴，週一及週二雨勢有時頗大。

06月04日（四）  29 - 35 °C   65 - 85 %
大致天晴，日間天氣酷熱。

06月05日（五）  29 - 36 °C   65 - 85 %
大致天晴，日間天氣酷熱。下午至黃昏部份地區可能有驟雨及雷暴。

更新時間：2026-06-04  17:00 MST
`;


//Tropical Cyclone Track
const forecastInfo = {
  updated: "06-04 17:00 MST"
};

const pastPoints = [
  {lat:19.0, lon:118.3, time:"06-04 14H", wind: 40},
  {lat:19.5, lon:118.6, time:"06-04 17H", wind: 45},
];

const forecastPoints = [
  {lat:19.5, lon:118.6, time: "06-04 17H", wind: 45,
  
    wind41: { ne: 0, se: 0, sw: 0, nw: 0 }, 
    wind88: { ne: 0, se: 0, sw: 0,  nw: 0 } 
  },
  { lat: 20.6, lon: 119.2, time: "06-05 02H", wind: 50 },  
  { lat: 22.4, lon: 121.1, time: "06-05 14H", wind: 55 },
  { lat: 25.6, lon: 124.2, time: "06-06 14H", wind: 65 },
  { lat: 31.1, lon: 131.2, time: "06-07 14H", wind: 75 },
  { lat: 34.8, lon: 140.4, time: "06-08 14H", wind: 65 },
  { lat: 42.5, lon: 149.0, time: "06-09 14H", wind: '-' },

];

window.tcInfo = {
  name: " 91W", 
  wind: forecastPoints[0].wind,
  pressure: 1004
};
