//Tropical Cyclone Warning
const tcWarnings = [
  {
    icon:"",
    text: "下午2時，位於台灣南部的熱帶低氣壓集結在本澳以東約755公里，即在北緯20.9度，東經119.3度附近，其中心附近最高持續風速約為每小時45公里，向東北移動，時速21公里。(2026-06-05 14:00 MST)"
  },
];

//Warning
const warnWarnings = [
  {
    icon: "warn_icon/h1.jpg",
    text: "酷熱警報於本地時間06月05日16時20分發出，取代非常酷熱警報。預料本澳明日部分地區天氣酷熱，最高氣溫約33度。"
  },
  {
    icon: "warn_icon/r0.jpg",
    text: "降雨預警於本地時間06月05日17時00分發出，有效時間至19時00分。位於本澳以北的雷雨區正移近。請市民留意天氣變化及最新天氣訊息。"
  }
];

//Special Warning Tips
const swtText = `受到熱帶低氣壓相關外圍下沉氣流影響，今日天氣非常酷熱，部份地區將達36-37度，體感溫度已達40度。市民避免戶外劇烈活動、穿著輕便及淺色的衣物、補充足夠水分，特別關注易受影響的族群。本台將會密切監察其發展及動向。(2026-06-05 12:40 MST)
`;

//Alert Tips
const alertipsText = `高溫預警提示於本地時間05月23日19時20分發出。表示澳門高溫天氣持續。（2026-06-04 14:20 MST 更新)`;

//Weather Forecast
const forecastRaw = `受到熱帶低氣壓相關外圍下沉氣流影響，今日天氣非常酷熱。同時，低層偏南氣流亦持續影響本澳，為大氣提供足夠水氣條件。配合高溫，本澳今日下午至黃昏有可能觸發熱對流發展，部份地區可能會出現驟雨及雷暴。一個偏東氣流將會在週末期間逐漸影響本澳，與西南季候風匯聚形成輻合帶，珠江口一帶下週初至中期雨勢加強，有大雨及雷暴，週一及週二雨勢有時頗大。

06月05日（五）  30 - 36 °C   65 - 85 %
大致天晴，日間天氣酷熱。下午至黃昏部份地區可能有驟雨及雷暴。

06月06日（六）  28 - 33 °C   65 - 85 %
日間部份時間有陽光，天氣酷熱，有幾陣驟雨及雷暴。

更新時間：2026-06-05  14:00 MST
`;

// 氣溫
const chartRightDate = "2026-06-05 00:00 MST";

const label24hX = ["00H","01H","02H","03H","04H","05H","06H","07H","08H","09H","10H","11H",
                   "12H","13H","14H","15H","16H","17H","18H","19H","20H","21H","22H","23H"];
const temp24h = [30,30,30,30,30,29,29,30,30,31,32,34,35,
                 36,36,33,31,30,31,31,31,30,30,30];

const label7dX = ["5","6","7","8","9","10","11"];
const temp7dMax = [36,32,30,28,28,29,30];
const temp7dMin = [29,26,25,25,25,25,26];


//Tropical Cyclone Track
const forecastInfo = {
  updated: "06-04 17:00 MST"
};

const pastPoints = [
  {lat:19.0, lon:118.3, time:"06-04 14H", wind: 40},
  {lat:19.5, lon:118.6, time:"06-04 17H", wind: 45},
];

const forecastPoints = [
  {lat:19.5, lon:118.6, time: "06-04 17H", wind: 45,
  
    wind41: { ne: 0, se: 0, sw: 0, nw: 0 }, 
    wind88: { ne: 0, se: 0, sw: 0,  nw: 0 } 
  },
  { lat: 20.6, lon: 119.2, time: "06-05 02H", wind: 50 },  
  { lat: 22.4, lon: 121.1, time: "06-05 14H", wind: 55 },
  { lat: 25.6, lon: 124.2, time: "06-06 14H", wind: 65 },
  { lat: 31.1, lon: 131.2, time: "06-07 14H", wind: 75 },
  { lat: 34.8, lon: 140.4, time: "06-08 14H", wind: 65 },
  { lat: 42.5, lon: 149.0, time: "06-09 14H", wind: '-' },

];

window.tcInfo = {
  name: " 91W", 
  wind: forecastPoints[0].wind,
  pressure: 1004
};
